solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf3000/fsl_pf3000.c
/*
 * Copyright 2016 Freescale Semiconductor, Inc.
 * Copyright 2016 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_common.h"
#include "fsl_pf3000.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/* CONCTL bit-field. */
#define PF3000_COIN_CTRL_ENABLE_MASK (0x08U)
#define PF3000_COIN_CTRL_VOLT_MASK   (0x07U)
#define PF3000_COIN_CTRL_VOLT_SHIFT  (0U)
#define PF3000_COIN_CTRL_VOLT(x)     (((uint8_t)((uint8_t)(x) << PF3000_COIN_CTRL_VOLT_SHIFT)) & PF3000_COIN_CTRL_VOLT_MASK)
/* PWRCTL bit-field. */
#define PF3000_PWR_CTRL_REGSCCP_ENABLE_MASK (0x80U)
#define PF3000_PWR_CTRL_STANDBYINV_MASK     (0x40U)
#define PF3000_PWR_CTRL_STBYDLY_MASK        (0x30U)
#define PF3000_PWR_CTRL_STBYDLY_SHIFT       (4U)
#define PF3000_PWR_CTRL_STBYDLY(x) \
    (((uint8_t)((uint8_t)(x) << PF3000_PWR_CTRL_STBYDLY_SHIFT)) & PF3000_PWR_CTRL_STBYDLY_MASK)
#define PF3000_PWR_CTRL_PWRONDBNC_MASK  (0x0CU)
#define PF3000_PWR_CTRL_PWRONDBNC_SHIFT (2U)
#define PF3000_PWR_CTRL_PWRONDBNC(x) \
    (((uint8_t)((uint8_t)(x) << PF3000_PWR_CTRL_PWRONDBNC_SHIFT)) & PF3000_PWR_CTRL_PWRONDBNC_MASK)
#define PF3000_PWR_CTRL_PWRONRSTEN_MASK (0x02U)
#define PF3000_PWR_CTRL_RESTARTEN_MASK  (0x01U)
/* SW1XVOLT, SW1XSTBY, SW1XOFF bit-field. */
#define PF3000_SW1X_VOLT_CTRL_MASK  (0x1FU)
#define PF3000_SW1X_VOLT_CTRL_SHIFT (0U)
#define PF3000_SW1X_VOLT_CTRL(x)    (((uint8_t)((uint8_t)(x) << PF3000_SW1X_VOLT_CTRL_SHIFT)) & PF3000_SW1X_VOLT_CTRL_MASK)
/* SW2VOLT, SW2STBY, SW2OFF bit-field. */
#define PF3000_SW2_VOLT_CTRL_MASK  (0x07U)
#define PF3000_SW2_VOLT_CTRL_SHIFT (0U)
#define PF3000_SW2_VOLT_CTRL(x)    (((uint8_t)((uint8_t)(x) << PF3000_SW2_VOLT_CTRL_SHIFT)) & PF3000_SW2_VOLT_CTRL_MASK)
/* SW3VOLT, SW3STBY, SW3OFF bit-field. */
#define PF3000_SW3_VOLT_CTRL_MASK  (0x0FU)
#define PF3000_SW3_VOLT_CTRL_SHIFT (0U)
#define PF3000_SW3_VOLT_CTRL(x)    (((uint8_t)((uint8_t)(x) << PF3000_SW3_VOLT_CTRL_SHIFT)) & PF3000_SW3_VOLT_CTRL_MASK)
/* SW MODE bit-field. */
#define PF3000_SW_MODE_OFF_MASK       (0x20U)
#define PF3000_SW_MODE_SELECTOR_MASK  (0x0FU)
#define PF3000_SW_MODE_SELECTOR_SHIFT (0U)
#define PF3000_SW_MODE_SELECTOR(x) \
    (((uint8_t)((uint8_t)(x) << PF3000_SW_MODE_SELECTOR_SHIFT)) & PF3000_SW_MODE_SELECTOR_MASK)
/* SW CONFIG bit-field. */
#define PF3000_SW_CTRL_DVSSPEED_MASK   (0x40U)
#define PF3000_SW_CTRL_PHASE_MASK      (0x30U)
#define PF3000_SW_CTRL_PHASE_SHIFT     (4U)
#define PF3000_SW_CTRL_PHASE(x)        (((uint8_t)((uint8_t)(x) << PF3000_SW_CTRL_PHASE_SHIFT)) & PF3000_SW_CTRL_PHASE_MASK)
#define PF3000_SW_CTRL_FREQUENCY_MASK  (0x0CU)
#define PF3000_SW_CTRL_FREQUENCY_SHIFT (2U)
#define PF3000_SW_CTRL_FREQUENCY(x) \
    (((uint8_t)((uint8_t)(x) << PF3000_SW_CTRL_FREQUENCY_SHIFT)) & PF3000_SW_CTRL_FREQUENCY_MASK)
#define PF3000_SW_CTRL_CURRENT_LIMIT_MASK (0x01U)
/* SW_BOOST_CTRL bit-field. */
#define PF3000_SW_BST_CTRL_STANDBY_MODE_MASK  (0x60U)
#define PF3000_SW_BST_CTRL_STANDBY_MODE_SHIFT (5U)
#define PF3000_SW_BST_CTRL_STANDBY_MODE(x) \
    (((uint8_t)((uint8_t)(x) << PF3000_SW_BST_CTRL_STANDBY_MODE_SHIFT)) & PF3000_SW_BST_CTRL_STANDBY_MODE_MASK)
#define PF3000_SW_BST_CTRL_NORMAL_MODE_MASK  (0x0CU)
#define PF3000_SW_BST_CTRL_NORMAL_MODE_SHIFT (2U)
#define PF3000_SW_BST_CTRL_NORMAL_MODE(x) \
    (((uint8_t)((uint8_t)(x) << PF3000_SW_BST_CTRL_NORMAL_MODE_SHIFT)) & PF3000_SW_BST_CTRL_NORMAL_MODE_MASK)
#define PF3000_SW_BST_CTRL_VOLT_MASK  (0x03U)
#define PF3000_SW_BST_CTRL_VOLT_SHIFT (0U)
#define PF3000_SW_BST_CTRL_VOLT(x) \
    (((uint8_t)((uint8_t)(x) << PF3000_SW_BST_CTRL_VOLT_SHIFT)) & PF3000_SW_BST_CTRL_VOLT_MASK)
/* VREFDDRCTL bit-field. */
#define PF3000_VREFDDR_SUPPLY_ENABLE_MASK (0x01U)
/* VSNVSCTL bit-field. */
#define PF3000_VSNVS_VOLT_CTRL_MASK  (0x07U)
#define PF3000_VSNVS_VOLT_CTRL_SHIFT (0U)
#define PF3000_VSNVS_VOLT_CTRL(x) \
    (((uint8_t)((uint8_t)(x) << PF3000_VSNVS_VOLT_CTRL_SHIFT)) & PF3000_VSNVS_VOLT_CTRL_MASK)
#define PF3000_VSNVS_VOLT_CTRL_VALUE (0x06U)
/* VLDO CTL bit-field. */
#define PF3000_LDO_OFF_MODE_MASK       (0x80U)
#define PF3000_LDO_LOW_POWER_MODE_MASK (0x40U)
#define PF3000_LDO_STANDBY_ON_OFF_MASK (0x20U)
#define PF3000_LDO_ENABLE_MASK         (0x10U)
#define PF3000_LDO_VOLT_CTRL_MASK      (0x0FU)
#define PF3000_LDO_VOLT_CTRL_SHIFT     (0U)
#define PF3000_LDO_VOLT_CTRL(x)        (((uint8_t)((uint8_t)(x) << PF3000_LDO_VOLT_CTRL_SHIFT)) & PF3000_LDO_VOLT_CTRL_MASK)
/* VCC_SDCTL bit-field. */
#define PF3000_VCC_SD_VOLT_CTRL_MASK  (0x03U)
#define PF3000_VCC_SD_VOLT_CTRL_SHIFT (0U)
#define PF3000_VCC_SD_VOLT_CTRL(x) \
    (((uint8_t)((uint8_t)(x) << PF3000_VCC_SD_VOLT_CTRL_SHIFT)) & PF3000_VCC_SD_VOLT_CTRL_MASK)
/* V33 bit-field. */
#define PF3000_V33_VOLT_CTRL_MASK  (0x03U)
#define PF3000_V33_VOLT_CTRL_SHIFT (0U)
#define PF3000_V33_VOLT_CTRL(x)    (((uint8_t)((uint8_t)(x) << PF3000_V33_VOLT_CTRL_SHIFT)) & PF3000_V33_VOLT_CTRL_MASK)
/* Page Selection bit-field. */
#define PF3000_PAGE_SELECTION_MASK  (0x0FU)
#define PF3000_PAGE_SELECTION_SHIFT (0U)
#define PF3000_PAGE_SELECTION(x)    (((uint8_t)((uint8_t)(x) << PF3000_PAGE_SELECTION_SHIFT)) & PF3000_PAGE_SELECTION_MASK)

/* Regulator Voltage Control Helper Macros. */
#define PF3000_SW1A_SET_POINT_MAX_NUM      (31U)
#define PF3000_SW1A_OUTPUT_LIMIT_LOW_DVS   (700000U)
#define PF3000_SW1A_OUTPUT_STEP_DVS        (25000U)
#define PF3000_SW1B_SET_POINT_MAX_NUM      (31U)
#define PF3000_SW1B_OUTPUT_LIMIT_LOW_DVS   (700000U)
#define PF3000_SW1B_OUTPUT_STEP_DVS        (25000U)
#define PF3000_SW2_SET_POINT_MAX_NUM       (7U)
#define PF3000_SW2_OUTPUT_LIMIT_LOW_DVS    (1500000U)
#define PF3000_SW2_OUTPUT_STEP_DVS         (50000U)
#define PF3000_SW3_SET_POINT_MAX_NUM       (15U)
#define PF3000_SW3_OUTPUT_LIMIT_LOW_DVS    (900000U)
#define PF3000_SW3_OUTPUT_STEP_DVS         (50000U)
#define PF3000_SW_BST_SET_POINT_MAX_NUM    (3U)
#define PF3000_SW_BST_OUTPUT_LIMIT_LOW_DVS (5000000U)
#define PF3000_SW_BST_OUTPUT_STEP_DVS      (50000U)
#define PF3000_LDOX_SET_POINT_MAX_NUM      (15U)
#define PF3000_LDOX_OUTPUT_LIMIT_LOW_DVS   (1800000U)
#define PF3000_LDOX_OUTPUT_STEP_DVS        (100000U)
#define PF3000_LDOY_SET_POINT_MAX_NUM      (15U)
#define PF3000_LDOY_OUTPUT_LIMIT_LOW_DVS   (800000U)
#define PF3000_LDOY_OUTPUT_STEP_DVS        (50000U)
#define PF3000_VCC_SD_SET_POINT_MAX_NUM    (3U)
#define PF3000_VCC_SD_OUTPUT_LIMIT_LOW_DVS (2850000U)
#define PF3000_VCC_SD_OUTPUT_STEP_DVS      (150000U)
#define PF3000_V33_SET_POINT_MAX_NUM       (3U)
#define PF3000_V33_OUTPUT_LIMIT_LOW_DVS    (2850000U)
#define PF3000_V33_OUTPUT_STEP_DVS         (150000U)
#define PF3000_VSNVS_OUTPUT_VOLTAGE        (3000000U)

