solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf3000/fsl_pf3000.c
/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Variables
 ******************************************************************************/
static const uint8_t regulatorCtrlRegTab[] = {
    PF3000_SW1A_CONF,  PF3000_SW1B_CONF,  PF3000_SW2_CONF,    PF3000_SW3_CONF,   PF3000_SWBST_CTRL,
    PF3000_VLDO1_CTRL, PF3000_VLDO2_CTRL, PF3000_VLDO3_CTRL,  PF3000_VLDO4_CTRL, PF3000_VCC_SD_CTRL,
    PF3000_V33_CTRL,   PF3000_VSNVS_CTRL, PF3000_VREFDDR_CTRL};

static const uint8_t switchVoltRegTab[][3] = {
    {PF3000_SW1A_VOLT, PF3000_SW1A_STBY, PF3000_SW1A_OFF},
    {PF3000_SW1B_VOLT, PF3000_SW1B_STBY, PF3000_SW1B_OFF},
    {PF3000_SW2_VOLT, PF3000_SW2_STBY, PF3000_SW2_OFF},
    {PF3000_SW3_VOLT, PF3000_SW3_STBY, PF3000_SW3_OFF},
};

/*******************************************************************************
 * Code
 ******************************************************************************/
static bool PF3000_ReadOtp(pf3000_handle_t *handle, uint8_t page, uint8_t reg, uint8_t *val)
{
    bool result = false;

    assert(handle);
    assert(val);
    assert((page == 0x01U) || (page == 0x02U));

    result = PF3000_WriteReg(handle, PF3000_PAGE_REGISTER, PF3000_PAGE_SELECTION(page));
    if (true == result)
    {
        result = PF3000_ReadReg(handle, reg, val);
    }

    return result;
}

static uint8_t PF3000_GetRegulatorSetPoint(pf3000_handle_t *handle, pf3000_module_t module, uint32_t voltage)
{
    uint8_t regulatorSetPoint = 0U;
    uint32_t index;

    assert(handle);
    assert((kPF3000_ModuleSwitch1A == module) || (kPF3000_ModuleSwitch1B == module) ||
           (kPF3000_ModuleSwitch2 == module) || (kPF3000_ModuleSwitch3 == module) ||
           (kPF3000_ModuleSwitchBoost == module) || (kPF3000_ModuleLdo1 == module) || (kPF3000_ModuleLdo2 == module) ||
           (kPF3000_ModuleLdo3 == module) || (kPF3000_ModuleLdo4 == module) || (kPF3000_ModuleVcc_sd == module) ||
           (kPF3000_ModuleV33 == module));

    switch (module)
    {
        /* Process Switch 1A. */
        case kPF3000_ModuleSwitch1A:
        /* Process Switch 1B. */
        case kPF3000_ModuleSwitch1B:
            if ((handle->switch1Mode == kPF3000_SW1SinglePhase) ||
                ((handle->switch1Mode == kPF3000_SW1IndependentMode) && (module == kPF3000_ModuleSwitch1A)))
            {
                /* Find the first Vset_point <= voltage */
                if (3300000U <= voltage)
                {
                    index = PF3000_SW1A_SET_POINT_MAX_NUM;
                }
                else if (1800000U <= voltage)
                {
                    index = PF3000_SW1A_SET_POINT_MAX_NUM - 1U;
                }
                else
                {
                    for (index = PF3000_SW1A_SET_POINT_MAX_NUM - 2U; index > 0U; index--)
                    {
                        if ((PF3000_SW1A_OUTPUT_LIMIT_LOW_DVS + (PF3000_SW1A_OUTPUT_STEP_DVS * index)) <= voltage)
                        {
                            break;
                        }
                    }
                }
            }
            else if ((handle->switch1Mode == kPF3000_SW1IndependentMode) && (module == kPF3000_ModuleSwitch1B))
            {
                /* Find the first Vset_point >= voltage */
                for (index = PF3000_SW1B_SET_POINT_MAX_NUM; index > 0U; index--)
                {
                    if ((PF3000_SW1B_OUTPUT_LIMIT_LOW_DVS + (PF3000_SW1B_OUTPUT_STEP_DVS * index)) <= voltage)
                    {
                        break;
                    }
                }
            }
            else
            {
                ;
            }
            break;

        /* Process Switch 2. */
        case kPF3000_ModuleSwitch2:
            /* OTP_SW2_HI= 0, SW2 is in low output voltage range */
            if (handle->switch2Range == kPF3000_SW2LowVoltRange)
            {
                for (index = PF3000_SW2_SET_POINT_MAX_NUM; index > 0U; index--)
                {
                    if ((PF3000_SW2_OUTPUT_LIMIT_LOW_DVS + (PF3000_SW2_OUTPUT_STEP_DVS * index)) <= voltage)
                    {
                        break;
                    }
                }
            }
            /* OTP_SW2_HI= 1, SW2 is in high output voltage range */
            else
            {
                if (3300000 <= voltage)
                {
                    index = 0x7U;
                }
                else if (3200000 <= voltage)
                {
                    index = 0x6U;
                }
                else if (3150000 <= voltage)
                {
                    index = 0x5U;
                }
                else if (3100000 <= voltage)
                {
                    index = 0x4U;
                }
                else if (3000000 <= voltage)
                {
                    index = 0x3U;
                }
                else if (2850000 <= voltage)
                {
                    index = 0x2U;
                }
                else if (2800000 <= voltage)
                {
                    index = 0x1U;
                }
                else
                {
                    index = 0x0U;
                }
            }
            break;

        /* Process Switch 3. */
        case kPF3000_ModuleSwitch3:
            for (index = PF3000_SW3_SET_POINT_MAX_NUM; index > 0U; index--)
            {
                if ((PF3000_SW3_OUTPUT_LIMIT_LOW_DVS + (PF3000_SW3_OUTPUT_STEP_DVS * index)) <= voltage)
                {
                    break;
                }
            }
            break;

        /* Process Switch Boost. */
        case kPF3000_ModuleSwitchBoost:
            for (index = PF3000_SW_BST_SET_POINT_MAX_NUM; index > 0U; index--)
            {
                if ((PF3000_SW_BST_OUTPUT_LIMIT_LOW_DVS + (PF3000_SW_BST_OUTPUT_STEP_DVS * index)) <= voltage)
                {
                    break;
                }
            }
            break;

