solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf3000/fsl_pf3000.c
        /* Process LDO X, including LDO1, LDO3, LDO4. */
        case kPF3000_ModuleLdo1:
        case kPF3000_ModuleLdo3:
        case kPF3000_ModuleLdo4:
            voltage = PF3000_LDOX_OUTPUT_LIMIT_LOW_DVS + PF3000_LDOX_OUTPUT_STEP_DVS * voltRegContent;
            break;

        /* Process LDO Y, including LDO2. */
        case kPF3000_ModuleLdo2:
            voltage = PF3000_LDOY_OUTPUT_LIMIT_LOW_DVS + PF3000_LDOY_OUTPUT_STEP_DVS * voltRegContent;
            break;

        /* Process Vcc_sd. */
        case kPF3000_ModuleVcc_sd:
            /* VSD_VSEL= 0. */
            if (handle->vccsdVsel == 0U)
            {
                voltage = PF3000_VCC_SD_OUTPUT_LIMIT_LOW_DVS + PF3000_VCC_SD_OUTPUT_STEP_DVS * voltRegContent;
            }
            /* VSD_VSEL= 1. */
            else
            {
                if (voltRegContent == 3U)
                {
                    voltage = 1850000U;
                }
                else
                {
                    voltage = 1800000U;
                }
            }
            break;

        /* Process Vcc_sd. */
        case kPF3000_ModuleV33:
            voltage = PF3000_V33_OUTPUT_LIMIT_LOW_DVS + PF3000_V33_OUTPUT_STEP_DVS * voltRegContent;
            break;

        /* Process Vsnvs. It's fixed in 3.0V, can't be changed. */
        case kPF3000_ModuleVsnvs:
            assert(voltRegContent == PF3000_VSNVS_VOLT_CTRL_VALUE);
            voltage = PF3000_VSNVS_OUTPUT_VOLTAGE;
            break;

        default:
            break;
    }

    return voltage;
}

void PF3000_GetDefaultConfig(pf3000_config_t *config)
{
    assert(config);

    /* Set callback function to NULL Pointer. */
    config->I2C_SendFunc    = NULL;
    config->I2C_ReceiveFunc = NULL;

    /* Set Default Slave Address. */
    config->slaveAddress = PF3000_DEFAULT_I2C_ADDR;
    /* Short-circuit protection enabled. */
    config->enableRegSCP = true;
    /* VSD_VSEL. */
    config->vccsdVsel = 0U;
}

void PF3000_Init(pf3000_handle_t *handle, const pf3000_config_t *config)
{
    uint8_t temp;
    uint8_t regValue;

    assert(handle);
    assert(config);

    /* Initialize Callback functions. */
    handle->I2C_SendFunc    = config->I2C_SendFunc;
    handle->I2C_ReceiveFunc = config->I2C_ReceiveFunc;
    /* Set Slave Address. */
    handle->slaveAddress = config->slaveAddress;

    /* Modify Switch Mode Register Value. */
    temp = (config->enableRegSCP ? PF3000_PWR_CTRL_REGSCCP_ENABLE_MASK : 0U);

    PF3000_ModifyReg(handle, PF3000_PWR_CTRL, PF3000_PWR_CTRL_REGSCCP_ENABLE_MASK, temp);

    /* VSD_VSEL. */
    handle->vccsdVsel = config->vccsdVsel;

    /* Read the register value of OTP SW1x CONFIG */
    PF3000_ReadOtp(handle, 0x01U, PF3000_OTP_SW1x_CONFIG, &regValue);
    /* SW1A SW1B mode selection. */
    handle->switch1Mode = (pf3000_switch1_mode_t)((regValue & 0x0CU) >> 2U);

    assert((handle->switch1Mode == kPF3000_SW1SinglePhase) || (handle->switch1Mode == kPF3000_SW1IndependentMode));

    /* Read the register value of OTP SW2 VOLT */
    PF3000_ReadOtp(handle, 0x01U, PF3000_OTP_SW2_VOLT, &regValue);
    /* SW2 voltage range. */
    handle->switch2Range = (regValue & 0x08U) ? (kPF3000_SW2HighVoltRange) : (kPF3000_SW2LowVoltRange);
}

bool PF3000_WriteReg(pf3000_handle_t *handle, uint8_t reg, uint8_t val)
{
    assert(handle);
    assert(handle->I2C_SendFunc);

    return handle->I2C_SendFunc(handle->slaveAddress, reg, 1U, &val, 1U);
}

bool PF3000_ReadReg(pf3000_handle_t *handle, uint8_t reg, uint8_t *val)
{
    assert(handle);
    assert(handle->I2C_ReceiveFunc);
    assert(val);

    return handle->I2C_ReceiveFunc(handle->slaveAddress, reg, 1U, val, 1U);
}

bool PF3000_ModifyReg(pf3000_handle_t *handle, uint8_t reg, uint8_t mask, uint8_t val)
{
    bool result = false;
    uint8_t regValue;

    assert(handle);

    /* Read back the register content. */
    result = PF3000_ReadReg(handle, reg, &regValue);
    if (true == result)
    {
        /* Modify the bit-fields you want to change. */
        regValue &= (uint8_t)~mask;
        regValue |= val;

        /* Write back the content to the registers. */
        result = PF3000_WriteReg(handle, reg, regValue);
    }

    return result;
}

bool PF3000_DumpReg(pf3000_handle_t *handle, uint8_t page, uint8_t reg, uint8_t *buffer, uint8_t size)
{
    bool result = true;
    uint8_t i;

    assert(handle);
    assert(buffer);
    assert((page == 0x00U) || (page == 0x01U) || (page == 0x02U));

    PF3000_WriteReg(handle, PF3000_PAGE_REGISTER, PF3000_PAGE_SELECTION(page));

    /* It seems that PF3000 only supports single-byte I2C transactions
       for read and write. */
    for (i = 0; i < size; i++)
    {
        if (false == PF3000_ReadReg(handle, reg++, buffer++))
        {
            result = false;
        }
    }

    return result;
}

void PF3000_EnableInterrupts(pf3000_handle_t *handle, uint32_t source)
{
    assert(handle);

    /* Enable INTSTAT0 interrupts. */
    PF3000_ModifyReg(handle, PF3000_SW_INT_MASK0, (source & 0xFFU), 0x0U);
    /* Enable INTSTAT1 interrupts. */
    PF3000_ModifyReg(handle, PF3000_SW_INT_MASK1, ((source & 0xFF00U) >> 8U), 0x0U);
    /* Enable INTSTAT3 interrupts. */
    PF3000_ModifyReg(handle, PF3000_SW_INT_MASK3, ((source & 0xFF0000U) >> 16U), 0x0U);
    /* Enable INTSTAT4 interrupts. */
    PF3000_ModifyReg(handle, PF3000_SW_INT_MASK4, ((source & 0xFF000000U) >> 24), 0x0U);
}

void PF3000_DisableInterrupts(pf3000_handle_t *handle, uint32_t source)
{
    assert(handle);

    /* Enable INTSTAT0 interrupts. */
    PF3000_ModifyReg(handle, PF3000_SW_INT_MASK0, 0x0U, (source & 0xFFU));
    /* Enable INTSTAT1 interrupts. */
    PF3000_ModifyReg(handle, PF3000_SW_INT_MASK1, 0x0U, ((source & 0xFF00U) >> 8U));
    /* Enable INTSTAT3 interrupts. */
    PF3000_ModifyReg(handle, PF3000_SW_INT_MASK3, 0x0U, ((source & 0xFF0000U) >> 16U));
    /* Enable INTSTAT4 interrupts. */
    PF3000_ModifyReg(handle, PF3000_SW_INT_MASK4, 0x0U, ((source & 0xFF000000U) >> 24));
}

