solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf3000/fsl_pf3000.c
uint32_t PF3000_GetInterruptStatus(pf3000_handle_t *handle)
{
    uint32_t status = 0x0U;
    uint8_t temp;

    assert(handle);

    /* Get INTSTAT0 interrupts flag. */
    PF3000_ReadReg(handle, PF3000_SW_INT_STAT0, &temp);
    status = temp;

    /* Get INTSTAT1 interrupts flag. */
    PF3000_ReadReg(handle, PF3000_SW_INT_STAT1, &temp);
    status |= (uint32_t)((uint32_t)temp << 8U);

    /* Get INTSTAT3 interrupts flag. */
    PF3000_ReadReg(handle, PF3000_SW_INT_STAT3, &temp);
    status |= (uint32_t)((uint32_t)temp << 16U);

    /* Get INTSTAT4 interrupts flag. */
    PF3000_ReadReg(handle, PF3000_SW_INT_STAT4, &temp);
    status |= (uint32_t)((uint32_t)temp << 24U);

    return status;
}

void PF3000_ClearInterruptStatus(pf3000_handle_t *handle, uint32_t source)
{
    assert(handle);

    /* Clear INTSTAT0 interrupts flag. */
    PF3000_WriteReg(handle, PF3000_SW_INT_STAT0, (source & 0xFFU));
    /* Clear INTSTAT1 interrupts flag. */
    PF3000_WriteReg(handle, PF3000_SW_INT_STAT1, ((source & 0xFF00U) >> 8U));
    /* Clear INTSTAT3 interrupts flag. */
    PF3000_WriteReg(handle, PF3000_SW_INT_STAT3, ((source & 0xFF0000U) >> 16U));
    /* Clear INTSTAT4 interrupts flag. */
    PF3000_WriteReg(handle, PF3000_SW_INT_STAT4, ((source & 0xFF000000U) >> 24U));
}

void PF3000_SetRegulatorOutputVoltage(pf3000_handle_t *handle,
                                      pf3000_module_t module,
                                      pf3000_operating_status_t status,
                                      uint32_t voltage)
{
    uint8_t regulatorVoltRegAddr;
    uint8_t regulatorVoltRegContent;
    uint8_t regulatorVoltRegMask;

    assert(handle);
    assert((kPF3000_ModuleSwitch1A == module) || (kPF3000_ModuleSwitch1B == module) ||
           (kPF3000_ModuleSwitch2 == module) || (kPF3000_ModuleSwitch3 == module) ||
           (kPF3000_ModuleSwitchBoost == module) || (kPF3000_ModuleLdo1 == module) || (kPF3000_ModuleLdo2 == module) ||
           (kPF3000_ModuleLdo3 == module) || (kPF3000_ModuleLdo4 == module) || (kPF3000_ModuleVcc_sd == module) ||
           (kPF3000_ModuleV33 == module));

    assert((kPF3000_OperatingStatusSystemOn == status) || (kPF3000_OperatingStatusStandby == status) ||
           (kPF3000_OperatingStatusOff == status));

    /* Get Register Value. */
    regulatorVoltRegContent = PF3000_GetRegulatorSetPoint(handle, module, voltage);

    switch (module)
    {
        /* Process SW1A, SW1B. */
        case kPF3000_ModuleSwitch1A:
        case kPF3000_ModuleSwitch1B:
            regulatorVoltRegAddr    = switchVoltRegTab[module][status];
            regulatorVoltRegContent = PF3000_SW1X_VOLT_CTRL(regulatorVoltRegContent);
            regulatorVoltRegMask    = PF3000_SW1X_VOLT_CTRL_MASK;
            break;

        /* Process SW2. */
        case kPF3000_ModuleSwitch2:
            regulatorVoltRegAddr    = switchVoltRegTab[module][status];
            regulatorVoltRegContent = PF3000_SW2_VOLT_CTRL(regulatorVoltRegContent);
            regulatorVoltRegMask    = PF3000_SW2_VOLT_CTRL_MASK;
            break;

        /* Process SW3. */
        case kPF3000_ModuleSwitch3:
            regulatorVoltRegAddr    = switchVoltRegTab[module][status];
            regulatorVoltRegContent = PF3000_SW3_VOLT_CTRL(regulatorVoltRegContent);
            regulatorVoltRegMask    = PF3000_SW3_VOLT_CTRL_MASK;
            break;

        /* Process Switch Boost. */
        case kPF3000_ModuleSwitchBoost:
            regulatorVoltRegAddr    = PF3000_SWBST_CTRL;
            regulatorVoltRegContent = PF3000_SW_BST_CTRL_VOLT(regulatorVoltRegContent);
            regulatorVoltRegMask    = PF3000_SW_BST_CTRL_VOLT_MASK;
            break;

        /* Process LDO1, LDO2, LDO3, LDO4. */
        case kPF3000_ModuleLdo1:
        case kPF3000_ModuleLdo2:
        case kPF3000_ModuleLdo3:
        case kPF3000_ModuleLdo4:
            regulatorVoltRegAddr    = regulatorCtrlRegTab[module];
            regulatorVoltRegContent = PF3000_LDO_VOLT_CTRL(regulatorVoltRegContent);
            regulatorVoltRegMask    = PF3000_LDO_VOLT_CTRL_MASK;
            break;

        /* Process Vcc_sd. */
        case kPF3000_ModuleVcc_sd:
            regulatorVoltRegAddr    = regulatorCtrlRegTab[module];
            regulatorVoltRegContent = PF3000_VCC_SD_VOLT_CTRL(regulatorVoltRegContent);
            regulatorVoltRegMask    = PF3000_VCC_SD_VOLT_CTRL_MASK;
            break;

        /* Process V33. */
        case kPF3000_ModuleV33:
            regulatorVoltRegAddr    = regulatorCtrlRegTab[module];
            regulatorVoltRegContent = PF3000_V33_VOLT_CTRL(regulatorVoltRegContent);
            regulatorVoltRegMask    = PF3000_V33_VOLT_CTRL_MASK;
            break;

        default:
            regulatorVoltRegAddr = 0x00U;
            regulatorVoltRegMask = 0x00U;
            break;
    }

    /* Modify corresponding registers. */
    PF3000_ModifyReg(handle, regulatorVoltRegAddr, regulatorVoltRegMask, regulatorVoltRegContent);
}

uint32_t PF3000_GetRegulatorOutputVoltage(pf3000_handle_t *handle,
                                          pf3000_module_t module,
                                          pf3000_operating_status_t status)
{
    uint8_t regulatorVoltRegAddr;
    uint8_t regulatorVoltRegContent;
    uint8_t regulatorVoltRegMask;
    uint32_t voltage = 0U;

    assert(handle);
    assert((kPF3000_ModuleSwitch1A == module) || (kPF3000_ModuleSwitch1B == module) ||
           (kPF3000_ModuleSwitch2 == module) || (kPF3000_ModuleSwitch3 == module) ||
           (kPF3000_ModuleSwitchBoost == module) || (kPF3000_ModuleLdo1 == module) || (kPF3000_ModuleLdo2 == module) ||
           (kPF3000_ModuleLdo3 == module) || (kPF3000_ModuleLdo4 == module) || (kPF3000_ModuleVcc_sd == module) ||
           (kPF3000_ModuleV33 == module) || (kPF3000_ModuleVsnvs == module));

    assert((kPF3000_OperatingStatusSystemOn == status) || (kPF3000_OperatingStatusStandby == status) ||
           (kPF3000_OperatingStatusOff == status));

