solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf3000/fsl_pf3000.c
void PF3000_SetSwitchAttribute(pf3000_handle_t *handle,
                               pf3000_module_t module,
                               const pf3000_switch_attribute_t *attribute)
{
    uint8_t switchModeRegAddr;
    uint8_t switchCtrlRegAddr;
    uint8_t temp;

    assert(handle);
    assert(attribute);
    assert((kPF3000_ModuleSwitch1A == module) || (kPF3000_ModuleSwitch1B == module) ||
           (kPF3000_ModuleSwitch2 == module) || (kPF3000_ModuleSwitch3 == module));

    /* Set Switch Mode Register. */
    switch (module)
    {
        case kPF3000_ModuleSwitch1A:
            switchModeRegAddr = PF3000_SW1A_MODE;
            break;

        case kPF3000_ModuleSwitch1B:
            switchModeRegAddr = PF3000_SW1B_MODE;
            break;

        case kPF3000_ModuleSwitch2:
            switchModeRegAddr = PF3000_SW2_MODE;
            break;

        case kPF3000_ModuleSwitch3:
            switchModeRegAddr = PF3000_SW3_MODE;
            break;

        default:
            switchModeRegAddr = 0x00U;
            break;
    }

    /* Modify Switch Mode Register Value. */
    temp = ((attribute->offMode ? PF3000_SW_MODE_OFF_MASK : 0U) | (PF3000_SW_MODE_SELECTOR(attribute->mode)));

    PF3000_ModifyReg(handle, switchModeRegAddr, PF3000_SW_MODE_OFF_MASK | PF3000_SW_MODE_SELECTOR_MASK, temp);

    /* Set Switch Control Register. */
    switchCtrlRegAddr = regulatorCtrlRegTab[module];

    /* Modify Switch Control Register Value. */
    temp = ((attribute->dvsSpeed ? PF3000_SW_CTRL_DVSSPEED_MASK : 0U) | (PF3000_SW_CTRL_PHASE(attribute->phaseClock)) |
            (PF3000_SW_CTRL_FREQUENCY(attribute->frequency)) |
            (attribute->currentLimit ? PF3000_SW_CTRL_CURRENT_LIMIT_MASK : 0U));

    PF3000_ModifyReg(handle, switchCtrlRegAddr,
                     PF3000_SW_CTRL_DVSSPEED_MASK | PF3000_SW_CTRL_PHASE_MASK | PF3000_SW_CTRL_FREQUENCY_MASK |
                         PF3000_SW_CTRL_CURRENT_LIMIT_MASK,
                     temp);
}

void PF3000_SetSwitchBoostAttribute(pf3000_handle_t *handle, const pf3000_switch_boost_attribute_t *attribute)
{
    uint8_t switchBoostCtrlRegAddr;
    uint8_t temp;

    assert(handle);
    assert(attribute);

    switchBoostCtrlRegAddr = regulatorCtrlRegTab[kPF3000_ModuleSwitchBoost];

    temp = (PF3000_SW_BST_CTRL_STANDBY_MODE(attribute->standbyMode) |
            PF3000_SW_BST_CTRL_NORMAL_MODE(attribute->normalMode));

    PF3000_ModifyReg(handle, switchBoostCtrlRegAddr,
                     PF3000_SW_BST_CTRL_STANDBY_MODE_MASK | PF3000_SW_BST_CTRL_NORMAL_MODE_MASK, temp);
}

void PF3000_SetLdoAttribute(pf3000_handle_t *handle, pf3000_module_t module, const pf3000_ldo_attribute_t *attribute)
{
    uint8_t ldoCtrlRegAddr;
    uint8_t temp;

    assert(handle);
    assert(attribute);
    assert((kPF3000_ModuleLdo1 == module) || (kPF3000_ModuleLdo2 == module) || (kPF3000_ModuleLdo3 == module) ||
           (kPF3000_ModuleLdo4 == module) || (kPF3000_ModuleVcc_sd == module) || (kPF3000_ModuleV33 == module));

    /* Set LDO to load switch mode. */
    ldoCtrlRegAddr = regulatorCtrlRegTab[module];

    temp = ((attribute->offMode ? PF3000_LDO_OFF_MODE_MASK : 0) |
            (attribute->enableLowPower ? PF3000_LDO_LOW_POWER_MODE_MASK : 0) |
            ((attribute->standbyOnOff == kPF3000_LdoOffDuringStandby) ? PF3000_LDO_STANDBY_ON_OFF_MASK : 0));

    PF3000_ModifyReg(handle, ldoCtrlRegAddr,
                     PF3000_LDO_OFF_MODE_MASK | PF3000_LDO_LOW_POWER_MODE_MASK | PF3000_LDO_STANDBY_ON_OFF_MASK, temp);
}

void PF3000_SetCoinCellAttribute(pf3000_handle_t *handle, const pf3000_coin_cell_attribute_t *attribute)
{
    uint8_t temp;

    assert(handle);
    assert(attribute);

    temp = ((attribute->enableCoinCellCharger ? PF3000_COIN_CTRL_ENABLE_MASK : 0) |
            PF3000_COIN_CTRL_VOLT(attribute->coinCellChargingVoltage));

    /* Set Coin Cell Control Register. */
    PF3000_ModifyReg(handle, PF3000_COIN_CTRL, PF3000_COIN_CTRL_ENABLE_MASK | PF3000_COIN_CTRL_VOLT_MASK, temp);
}

void PF3000_SetStandbyPadAttribute(pf3000_handle_t *handle, const pf3000_standby_attribute_t *attribute)
{
    uint8_t temp;

    assert(handle);
    assert(attribute);

    temp = ((attribute->standbyPolarity ? PF3000_PWR_CTRL_STANDBYINV_MASK : 0U) |
            PF3000_PWR_CTRL_STBYDLY(attribute->standbyDelay));

    /* Set Coin Cell Control Register. */
    PF3000_ModifyReg(handle, PF3000_PWR_CTRL, PF3000_PWR_CTRL_STANDBYINV_MASK | PF3000_PWR_CTRL_STBYDLY_MASK, temp);
}

void PF3000_SetPwrOnPadAttibute(pf3000_handle_t *handle, const pf3000_power_on_attribute_t *attribute)
{
    uint8_t temp;

    assert(handle);
    assert(attribute);

    temp = (PF3000_PWR_CTRL_PWRONDBNC(attribute->debounce) |
            (attribute->longPressAllowOffMode ? PF3000_PWR_CTRL_PWRONRSTEN_MASK : 0U) |
            (attribute->longPressRestart ? PF3000_PWR_CTRL_RESTARTEN_MASK : 0U));

    /* Set Coin Cell Control Register. */
    PF3000_ModifyReg(handle, PF3000_PWR_CTRL,
                     PF3000_PWR_CTRL_PWRONDBNC_MASK | PF3000_PWR_CTRL_PWRONRSTEN_MASK | PF3000_PWR_CTRL_RESTARTEN_MASK,
                     temp);
}
/*******************************************************************************
 * EOF
 ******************************************************************************/
